[
  [
    "bridges",
    1,
    "Short Bridges",
    "Lie on your back with knees bent and feet flat on the floor. Place your hands at your sides, then lift your hips off the ground, creating a straight line from your knees to shoulders. Lower back down slowly.",
    "1 set of 10",
    "2 sets of 25",
    "3 sets of 50"
  ],
  [
    "bridges",
    2,
    "Straight Bridges",
    "Sit on the floor with legs extended in front of you and palms on the floor behind you. Press through your hands and heels to lift your body, creating a straight line from shoulders to heels. Lower back down slowly.",
    "1 set of 10",
    "2 sets of 20",
    "3 sets of 40"
  ],
  [
    "bridges",
    3,
    "Angled Bridges",
    "Lie on your back with hands and feet on the ground, similar to a standard bridge, but place your hands further back towards your head. Push through your hands and feet to lift your body up at an angle. Lower back down slowly.",
    "1 set of 8",
    "2 sets of 15",
    "3 sets of 30"
  ],
  [
    "bridges",
    4,
    "Head Bridges",
    "Lie on your back with knees bent, feet flat, and hands by your ears. Push through your feet and hands to lift yourself, resting the crown of your head on the floor. Lower back down slowly.",
    "1 set of 8",
    "2 sets of 15",
    "3 sets of 25"
  ],
  [
    "bridges",
    5,
    "Half Bridges",
    "Lie on your back, bend your knees, and place your hands next to your head. Push up through your hands and feet, bringing your head and shoulders off the ground but keeping a bend in your elbows. Lower back down slowly.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "bridges",
    6,
    "Full Bridges",
    "Lie on your back, place your hands by your ears, and push through your hands and feet to lift your body into a full bridge, creating a complete arch. Lower back down slowly.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "bridges",
    7,
    "Wall Walking Bridges (Down)",
    "Stand facing away from a wall and bend backward to place your hands on the wall. Walk your hands down the wall until you reach a deep backbend, then walk your hands back up to stand.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "bridges",
    8,
    "Wall Walking Bridges (Up and Down)",
    "Stand facing away from the wall, bend backward to place your hands on the wall, and walk your hands down until you reach the bottom. Walk back up to standing. This variation adds extra control on the ascent and descent.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "bridges",
    9,
    "Closing Bridges",
    "Lie on your back, push into a full bridge, and then lower your head and shoulders back down with control, creating a closing and opening motion. This emphasizes strength and control.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "bridges",
    10,
    "Stand-to-Stand Bridges",
    "Stand upright, bend backward into a full bridge until your hands reach the ground, then push back up to standing without support. This advanced move requires exceptional strength, flexibility, and control.",
    "1 set of 1",
    "2 sets of 3",
    "2 sets of 10"
  ],
  [
    "pushups",
    "1",
    "Wall Pushups",
    "Stand a couple of feet away from a wall, place your hands shoulder-width apart at chest height on the wall. Keep your body straight and slowly bend your elbows to bring your chest towards the wall, then push back to the starting position.",
    "1 set of 10",
    "2 sets of 25",
    "3 sets of 50"
  ],
  [
    "pushups",
    "2",
    "Incline Pushups",
    "Find an elevated surface (like a table or bench) and place your hands shoulder-width apart. Step back so your body forms a straight line from head to heels. Bend your elbows to lower your chest towards the surface, then press back up.",
    "1 set of 10",
    "2 sets of 20",
    "2 sets of 40"
  ],
  [
    "pushups",
    "3",
    "Kneeling Pushups",
    "Start in a pushup position but with your knees on the floor and feet lifted. Hands should be shoulder-width apart, slightly in front of your shoulders. Lower your chest to the ground by bending your elbows, keeping your back straight. Press back up to complete one rep.",
    "1 set of 10",
    "2 sets of 20",
    "2 sets of 35"
  ],
  [
    "pushups",
    "4",
    "Half Pushups",
    "Begin in a regular pushup position with your body in a straight line and hands shoulder-width apart. Lower only halfway down, about a 90-degree bend at the elbows, then push back up.",
    "1 set of 8",
    "2 sets of 15",
    "2 sets of 30"
  ],
  [
    "pushups",
    "5",
    "Full Pushups",
    "Start in a high plank position with hands directly under your shoulders and body in a straight line. Lower your body until your chest almost touches the ground, then push back up to the starting position.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 25"
  ],
  [
    "pushups",
    "6",
    "Close Pushups",
    "Place your hands closer together than shoulder width, with thumbs and index fingers forming a diamond shape beneath your chest. Lower down until your chest nearly touches your hands, then push back up.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "pushups",
    "7",
    "Uneven Pushups",
    "Place one hand on an elevated object (like a small box) and the other on the floor. Lower yourself down until your chest is close to the ground, then push back up. Switch sides after completing your reps.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "pushups",
    "8",
    "1/2 One-Arm Pushups",
    "Position yourself in a pushup stance, but with one hand behind your back or at your side. Lower your body halfway down with your working arm and push back up. Spread your legs wider for balance.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "pushups",
    "9",
    "Lever Pushups",
    "Assume a pushup position, placing one hand slightly in front and the other closer to your waist. Lower down, maintaining a straight body, then push back up. This forces one arm to work harder.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "pushups",
    "10",
    "One-Arm Pushups",
    "Start with feet wide apart for stability, one hand behind your back. Place the working hand closer to the center of your chest. Lower yourself down, then press back up, maintaining a straight body.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "squats",
    "1",
    "Shoulderstand Squats",
    "Lie on your back with legs straight up in the air, supporting your lower back with your hands. Bend your knees and lower your feet towards your head, then straighten your legs back up. This reduces the load, making it easier for beginners.",
    "1 set of 10",
    "2 sets of 25",
    "3 sets of 50"
  ],
  [
    "squats",
    "2",
    "Jackknife Squats",
    "Stand in front of a chair, holding onto the back for support. Lower yourself into a squat by bending your knees, then return to the standing position. This helps you develop balance and basic squat form.",
    "1 set of 10",
    "2 sets of 20",
    "3 sets of 40"
  ],
  [
    "squats",
    "3",
    "Supported Squats",
    "Stand near a wall or pole and hold on for support. Lower yourself into a full squat position, then push back up. This exercise builds leg strength while providing stability.",
    "1 set of 10",
    "2 sets of 20",
    "3 sets of 35"
  ],
  [
    "squats",
    "4",
    "Half Squats",
    "Stand with feet shoulder-width apart. Lower yourself halfway down, until your knees are at about a 90-degree angle, then push back up. Focus on controlled movement and proper form.",
    "1 set of 8",
    "2 sets of 15",
    "2 sets of 30"
  ],
  [
    "squats",
    "5",
    "Full Squats",
    "Stand with feet shoulder-width apart. Lower yourself all the way down until your hamstrings touch your calves, then press back up to the starting position. Keep your core engaged and back straight.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 30"
  ],
  [
    "squats",
    "6",
    "Close Squats",
    "Stand with feet close together, about an inch apart. Lower yourself into a deep squat, then push back up. This variation emphasizes balance and control.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "squats",
    "7",
    "Uneven Squats",
    "Place one foot on a slightly elevated surface, like a small box, and keep the other on the ground. Lower yourself down, then push back up. This uneven position builds strength in each leg.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20 per side"
  ],
  [
    "squats",
    "8",
    "1/2 One-Leg Squats",
    "Stand on one leg, keeping the other leg slightly bent in front of you. Lower halfway down, then push back up. This half-range squat helps develop single-leg strength.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20 per leg"
  ],
  [
    "squats",
    "9",
    "Assisted One-Leg Squats",
    "Stand on one leg, with one hand holding onto a support for balance. Lower yourself into a full one-leg squat, then push back up. This builds strength while offering some support.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20 per leg"
  ],
  [
    "squats",
    "10",
    "One-Leg Squats",
    "Stand on one leg with the other extended in front of you. Lower yourself all the way down to a full squat, then press back up. This advanced squat requires significant balance, strength, and control.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20 per leg"
  ],
  [
    "pullups",
    "1",
    "Vertical Pulls",
    "Stand facing a bar set at chest height or lower. Grip the bar and lean back, keeping your feet on the ground. Pull your chest towards the bar, then lower back. This is a great introduction to pull movements.",
    "1 set of 10",
    "2 sets of 20",
    "3 sets of 40"
  ],
  [
    "pullups",
    "2",
    "Horizontal Pulls",
    "Lie under a low bar with your feet on the floor and grip the bar. Pull your chest towards the bar, then lower back down. This move starts to shift the body’s weight more onto the upper body.",
    "1 set of 10",
    "2 sets of 20",
    "3 sets of 30"
  ],
  [
    "pullups",
    "3",
    "Jackknife Pulls",
    "Sit under a bar with your legs extended and grip the bar above you. Keep your heels on the ground for support as you pull your chest towards the bar, then lower yourself back down. This provides more upper body resistance while keeping some leg support.",
    "1 set of 8",
    "2 sets of 15",
    "3 sets of 25"
  ],
  [
    "pullups",
    "4",
    "Half Pullups",
    "Hang from a pullup bar with an overhand grip. Pull yourself halfway up, so that your elbows form a 90-degree angle, then lower back down. This helps build strength without the full range of motion.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "pullups",
    "5",
    "Full Pullups",
    "Hang from a pullup bar with an overhand grip. Pull yourself up until your chin is above the bar, then lower back down in a controlled motion. Keep your core engaged and avoid swinging.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "pullups",
    "6",
    "Close Pullups",
    "Hang from the bar with your hands close together, palms facing forward. Pull yourself up until your chin clears the bar, then lower yourself back down. This variation places more emphasis on the biceps.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "pullups",
    "7",
    "Uneven Pullups",
    "Grip the bar with one hand above and the other gripping lower or on a towel. Pull yourself up, using more strength on the upper hand. Switch sides each set to work both arms evenly.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15 per side"
  ],
  [
    "pullups",
    "8",
    "1/2 One-Arm Pullups",
    "Grip the bar with one hand, and keep the other hand holding your wrist or forearm. Pull yourself up halfway, then lower back down. This helps build the strength needed for full one-arm pullups.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15 per arm"
  ],
  [
    "pullups",
    "9",
    "Assisted One-Arm Pullups",
    "Grip the bar with one hand and use the other hand to assist slightly, either on a band or by holding a lower support. Perform a full pullup with the working arm, using minimal assistance.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15 per arm"
  ],
  [
    "pullups",
    "10",
    "One-Arm Pullups",
    "Grip the bar with one hand, keeping the other arm relaxed. Pull yourself up until your chin is above the bar, then lower back down. This challenging exercise requires significant strength and control.",
    "1 set of 1",
    "2 sets of 3",
    "2 sets of 5"
  ],
  [
    "leg raises",
    "1",
    "Knee Tucks",
    "Lie on your back with hands under your lower back or at your sides. Bend your knees and pull them towards your chest, then extend your legs back out without touching the floor. This beginner movement engages the core while reducing the load on the legs.",
    "1 set of 10",
    "2 sets of 25",
    "3 sets of 40"
  ],
  [
    "leg raises",
    "2",
    "Flat Knee Raises",
    "Lie flat on your back with your legs extended. Keep your knees bent and lift them towards your chest, then lower your feet back to the ground in a controlled manner. This exercise builds strength in the lower abs.",
    "1 set of 10",
    "2 sets of 20",
    "3 sets of 35"
  ],
  [
    "leg raises",
    "3",
    "Flat Bent-Leg Raises",
    "Lie flat on your back, bend your knees at a 90-degree angle, and raise your legs until your thighs are perpendicular to the ground. Lower your legs back to the starting position without touching the floor.",
    "1 set of 8",
    "2 sets of 15",
    "3 sets of 30"
  ],
  [
    "leg raises",
    "4",
    "Flat Frog Raises",
    "Lie flat with legs extended and feet together. Bend your knees outwards like a frog, bringing them towards your chest, then straighten your legs back to the starting position. This position increases the difficulty by engaging more of the core.",
    "1 set of 8",
    "2 sets of 15",
    "3 sets of 25"
  ],
  [
    "leg raises",
    "5",
    "Flat Straight Leg Raises",
    "Lie on your back with legs extended. Keep your legs straight and lift them to a 90-degree angle, then lower them back down in a controlled manner without touching the ground. This targets the lower abs more intensely.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "leg raises",
    "6",
    "Hanging Knee Raises",
    "Hang from a bar with a shoulder-width grip. Bend your knees and lift them towards your chest, then lower them back down in a controlled motion. This move increases the challenge by adding grip and upper body stability requirements.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 20"
  ],
  [
    "leg raises",
    "7",
    "Hanging Bent-Leg Raises",
    "Hang from a bar with your legs bent at 90 degrees. Lift your knees towards your chest, then lower them back down without swinging. This progression focuses on maintaining control while suspended.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "leg raises",
    "8",
    "Hanging Frog Raises",
    "Hang from a bar with legs extended. Bend your knees outwards, bringing them up towards your chest, then lower back down. This frog-like position requires more core activation to stabilize.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "leg raises",
    "9",
    "Partial Hanging Leg Raises",
    "Hang from a bar with legs straight. Lift your legs halfway to 90 degrees, then lower them back down. This builds core strength needed for the full range of motion.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "leg raises",
    "10",
    "Hanging Straight Leg Raises",
    "Hang from a bar with legs straight. Lift your legs up to a 90-degree angle, then slowly lower back down in a controlled movement. This advanced exercise requires strong abs and significant control.",
    "1 set of 5",
    "2 sets of 10",
    "2 sets of 15"
  ],
  [
    "handstand pushups",
    "1",
    "Wall Headstands",
    "Kneel facing a wall and place your hands on the ground. Kick your legs up and rest your feet against the wall in a headstand position, keeping your hands, head, and neck stable. Hold this position to build shoulder and neck stability.",
    "1 set of 30 seconds",
    "2 sets of 1 minute",
    "3 sets of 2 minutes"
  ],
  [
    "handstand pushups",
    "2",
    "Crow Stands",
    "Start in a crouched position with your hands on the floor and knees resting on your elbows. Shift your weight forward and lift your feet off the ground, balancing on your hands. This strengthens the shoulders and wrists while improving balance.",
    "1 set of 10 seconds",
    "2 sets of 30 seconds",
    "3 sets of 1 minute"
  ],
  [
    "handstand pushups",
    "3",
    "Wall Handstands",
    "Face away from a wall, place your hands on the ground, and walk your feet up the wall until your body is vertical. Hold this position, pressing through your hands and keeping your core tight to build shoulder and core strength.",
    "1 set of 30 seconds",
    "2 sets of 1 minute",
    "3 sets of 2 minutes"
  ],
  [
    "handstand pushups",
    "4",
    "Half Handstand Pushups",
    "Perform a wall handstand, then bend your elbows slightly and push back up, working within a limited range of motion. This progression develops shoulder and triceps strength.",
    "1 set of 5 reps",
    "2 sets of 10 reps",
    "2 sets of 20 reps"
  ],
  [
    "handstand pushups",
    "5",
    "Full Handstand Pushups",
    "In a wall-supported handstand, lower yourself until your head nearly touches the ground, then push back up. This full range of motion builds significant strength in the shoulders, chest, and triceps.",
    "1 set of 5 reps",
    "2 sets of 8 reps",
    "2 sets of 15 reps"
  ],
  [
    "handstand pushups",
    "6",
    "Close Handstand Pushups",
    "Perform handstand pushups while keeping your hands closer together, increasing the challenge on your triceps and shoulder stability. Ensure control throughout each rep.",
    "1 set of 5 reps",
    "2 sets of 8 reps",
    "2 sets of 15 reps"
  ],
  [
    "handstand pushups",
    "7",
    "Uneven Handstand Pushups",
    "In a handstand position against the wall, place one hand on a slightly elevated surface, such as a block, and perform pushups. This uneven position challenges stability and strength asymmetrically.",
    "1 set of 5 reps",
    "2 sets of 8 reps",
    "2 sets of 15 reps"
  ],
  [
    "handstand pushups",
    "8",
    "Half One-Arm Handstand Pushups",
    "In a wall-supported handstand, shift most of your weight to one arm, then bend your elbow slightly and push back up. Perform this on each arm to improve single-arm strength and control.",
    "1 set of 5 reps",
    "2 sets of 8 reps",
    "2 sets of 15 reps"
  ],
  [
    "handstand pushups",
    "9",
    "Lever Handstand Pushups",
    "In a handstand, keep one arm straight and the other slightly bent, working towards lowering and pushing up with the bent arm only. This level prepares you for the final progression by strengthening one-arm push capacity.",
    "1 set of 5 reps",
    "2 sets of 8 reps",
    "2 sets of 15 reps"
  ],
  [
    "handstand pushups",
    "10",
    "One-Arm Handstand Pushups",
    "In a wall-supported one-arm handstand, bend your supporting arm to lower your body, then push back up. This advanced progression requires immense shoulder, triceps, and core strength to execute with proper form.",
    "1 set of 1 rep per arm",
    "2 sets of 3 reps per arm",
    "2 sets of 5 reps per arm"
  ]
]